## Assignment - Explore the Demographics Data

The accompanying table shows a portion of data that shows an individualâ€™s income (Income in $1,000s), age, sex (F = female, M = male), and marital status (Married; Y = yes, N = no).

In [11]:
# load the data
import pandas as pd

df = pd.read_csv("Demographics.csv")
df.head()

   Individual  Income  Age Sex Married
0         272   147.0   55   M       Y
1         364   140.0   52   M       Y
2         514   140.0   54   M       N
3         476   138.0   56   F       Y
4         641   130.0   45   M       N

Action Items:
1. Count the number of rows and columns
2. What variable(s) have the missing values? 
3. Count the number of males and females in the data uisng `value_counts()`.
4. sort the data by Income and Age, and pick the top 10 records.
5. Of the 10 individuals with the highest income, select the married males. hint: 
    - Sort the data to get 10 individuals with the highest income. 
    - Save the data to a new dataframe. The code would be something like `df_top10 = df.sort_values(...).head(...`
    - Select the rows by married males.
6. Fill the missing values with mean.

### Instructor Solutions

In [2]:
df.shape

(890, 5)

In [3]:
df.isna().sum()

Individual     0
Income        12
Age            0
Sex            0
Married        0
dtype: int64

In [3]:
df.Sex.value_counts()

M    508
F    382
Name: Sex, dtype: int64

In [4]:
df.sort_values(by=['Income', 'Age'], ascending=False).head(10)

    Individual  Income  Age Sex Married
0          272   147.0   55   M       Y
2          514   140.0   54   M       N
1          364   140.0   52   M       Y
3          476   138.0   56   F       Y
4          641   130.0   45   M       N
5          390   129.0   55   M       Y
6          623   128.0   53   M       Y
8          675   126.0   55   M       Y
9          858   126.0   52   M       Y
10          44   125.0   48   M       N

In [7]:
df2=df.sort_values(by=['Income'], ascending=False).head(10)
df2[(df2.Sex == 'M') & (df2.Married == 'Y')]

   Individual  Income  Age Sex Married
0         272   147.0   55   M       Y
1         364   140.0   52   M       Y
5         390   129.0   55   M       Y
6         623   128.0   53   M       Y
8         675   126.0   55   M       Y
9         858   126.0   52   M       Y

In [7]:
df['Income'] = df['Income'].fillna(df['Income'].mean())
df.head()

   Individual  Income  Age Sex Married
0         272   147.0   55   M       Y
1         364   140.0   52   M       Y
2         514   140.0   54   M       N
3         476   138.0   56   F       Y
4         641   130.0   45   M       N

In [8]:
df = df.fillna(df.mean())

C:\Users\bkwei\AppData\Local\Temp\ipykernel_4140\114435927.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df = df.fillna(df.mean())

In [9]:
df.isna().sum()

Individual    0
Income        0
Age           0
Sex           0
Married       0
dtype: int64